---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.StructuralMaterialType.PrecastConcrete
enum: Autodesk.Revit.DB.Structure.StructuralMaterialType
source: html/133caafb-a1f6-699a-fde1-f5fb79e64560.htm
---
# Autodesk.Revit.DB.Structure.StructuralMaterialType.PrecastConcrete

Structural material type is precast concrete.